Repository: fusion-jeunesse/AvantElements
Catalog: languages/*.po
Languages: fr

source: The order to display elements on public Show pages.
fr: L'ordre pour afficher les éléments sur les page d'affichage public.

source: Elements that should link to items with the the same value.
fr: Les éléments qui devraient être liés aux contenus avec la même valeur.

source: Elements that link to external web resources.
fr: Les éléments qui sont liés aux ressources web externes.

source: Hide element descriptions.
fr: Cacher les descriptions d'élément.

source: Elements that must be validated.
fr: Les éléments doivent être validés.

source: Elements that show the Add Input button.
fr: Les éléments qui affichent le bouton Ajouter une entrée (Add Input).

source: Elements that show the Use HTML checkbox.
fr: Les éléments qui affichent la case à cocher Utiliser le HTML (Use HTML).

source: Elements that should display as a text field.
fr: Les éléments qui devraient apparaître en tant que champ de texte.

source: SimpleVocab elements that display as a dropdown list.
fr: Les éléments Vocabulaire Simple qui s'affichent comme une liste déroulante.

source: Elements that should display as a checkbox.
fr: Les éléments qui devraient s'afficher comme une case à cocher.

source: Elements that should display as read-only.
fr: Les éléments qui devraient s'afficher en lecture seule.

source: Default values to use when adding a new Item.
fr: Les valeurs par défaut à utiliser lorsqu'un nouveau contenu est ajouté.

source: Elements that should offer input suggestions.
fr: Les éléments qui devraient offrir des suggestions d'entrée.

source: Elements that should stay in sync with corrresponding titles.
fr: Les éléments qui devraient rester synchronisés avec les titres correspondants.

source: Callback functions to be called for individual elements.
fr: Les fonctions de rappel à appeler pour les éléments individuels.

source: When Date is empty, Year Start and Year End must each be set to a different year
fr: Lorsque Date est vide, Année de début et Année de fin doivent être assignés à des années différentes

source: Year Start must be less than Year End
fr: L'année de début doit être avant l'année de fin

source: Add Item
fr: Ajouter un contenu

source: Save Changes
fr: Sauvegarder les changements

source: When Date is set, Year Start and Year End must be set to the same year as Date
fr: Lorsqu'une date est spécifiée, l'année de début et l'année de fin doivent correspondre à l'année spécifiée dans la date

source: Value must be in the form YYYY-MM-DD or YYYY-MM or YYYY.
fr: La valeur doit prendre la forme AAAA-MM-JJ ou AAAA-MM ou AAAA.

source: Value must be a year consisting of exactly four digits with no leading or trailing spaces.
fr: La valeur doit être une année composée de quatre chiffres, sans espace avant ou après.

source: --- DUPLICATE --- %s
fr: --- COPIER --- %s

source: Duplicate This Item
fr: Copier ce contenu

source: Select Below
fr: Choisir ci-dessous

source: [ Type more letters to refine your search ]
fr: [ Ajouter des lettres pour affiner votre recherche ]

source: A value is required.
fr: Une valeur est requise.

source: Allow Add Input
fr: Permettre l'ajout d'entrée (Add Input)

source: Custom Callback
fr: Rappel personnalisé

source: Checkbox Field
fr: Champ case à cocher

source: Default Value
fr: Valeur par défaut

source: Display Order
fr: Ordre d'apparition

source: External Link
fr: Lien externe

source: Hide Descriptions
fr: Cacher les descriptions

source: Allow HTML
fr: Permettre le HTML

source: Implicit Link
fr: Lien implicite

source: Read-only Field
fr: Champ lecture seule

source: SimpleVocab Field
fr: Champ Vocabulaire Simple

source: Suggest
fr: Suggérer

source: Text Field
fr: Champ texte

source: Title Sync
fr: Synchronisation des titres

source: Missing callback type. Options: %s.
fr: Type de rappel manquant. Options : %s.

source: Invalid callback type '%s'. Options: %s.
fr: Type de rappel invalide '%s'. Options: %s.

source: No callback function specified.
fr: Aucune fonction de rappel n'est spécifiée.

source: No callback class specified.
fr: Aucune classe de rappel n'est spécifiée.

source: A custom filter for %s cannot be used because %s is specified in the Implicit Link option.
fr: Un filtre personnalisé %s ne peut être utilisé puisque %s est spécifié dans l'option Lien implicite.

source: See the Implicit Link option documentation to learn how to resolve this conflict.
fr: Consultez la documentation sur l'option Lien implicite pour savoir comment résoudre ce conflit.

source: A custom filter for %s cannot be used because %s is specified in the External Link option.
fr: Un filtre personnalisé %s ne peut être utilisé puisque %s est spécifié dans l'option Lien externe.

source: Missing text to display when checked
fr: Texte manquant à afficher lorsque coché

source: No value specified.
fr: Aucune valeur spécifiée.

source: '%s' is not valid for the Open action. Options: true, false.
fr: '%s' n'est pas valide pour l'action Ouvrir. Options : vrai, faux.

source: Width '%s' is invalid. Specify an integer greater than 20.
fr: La largeur '%s' n'est pas valide. Choisir un entier plus grand que 20.

source: '%s' is not a SimpleVocab element.
fr: '%s' n'est pas un élément Vocabulaire Simple.

source: At least one validation parameter is required.
fr: Au moins un paramètre de validation est requis.

source: '%s' is not a valid parameter. Options: %s.
fr: '%s' n'est pas un paramètre valide. Options : %s.

source: See other items that have this value
fr: Voir les autres contenus qui ont cette valeur
